INSERT INTO exchange_rate (
    rate_date, currency_id, num_code, char_code,
    nominal, name, value_rate, vunit_rate
) VALUES
    ('2020-03-15', 'R01010', '036', 'AUD', 1, 'Австралийский доллар', 45.2345, 45.2345),
    ('2020-03-15', 'R01035', '826', 'GBP', 1, 'Фунт стерлингов', 82.4567, 82.4567),
    ('2020-03-15', 'R01090', '974', 'BYR', 1000, 'Белорусских рублей', 25.8765, 0.0258765),
    ('2020-03-15', 'R01235', '840', 'USD', 1, 'Доллар США', 65.3210, 65.3210),
    ('2020-03-15', 'R01239', '978', 'EUR', 1, 'Евро', 72.2345, 72.2345),
    ('2020-03-15', 'R01375', '156', 'CNY', 10, 'Китайский юань', 92.7654, 9.27654);

INSERT INTO exchange_rate (
    rate_date, currency_id, num_code, char_code,
    nominal, name, value_rate, vunit_rate
) VALUES
    ('2021-12-12', 'R01010', '036', 'AUD', 1, 'Австралийский доллар', 55.6789, 55.6789),
    ('2021-12-12', 'R01035', '826', 'GBP', 1, 'Фунт стерлингов', 98.7654, 98.7654),
    ('2021-12-12', 'R01090', '974', 'BYR', 1000, 'Белорусских рублей', 30.1234, 0.0301234),
    ('2021-12-12', 'R01235', '840', 'USD', 1, 'Доллар США', 74.5678, 74.5678),
    ('2021-12-12', 'R01239', '978', 'EUR', 1, 'Евро', 85.4321, 85.4321),
    ('2021-12-12', 'R01375', '156', 'CNY', 10, 'Китайский юань', 116.7890, 11.67890),
    ('2021-12-12', 'R01565', '392', 'JPY', 100, 'Японская иена', 65.4321, 0.654321);

INSERT INTO exchange_rate (
    rate_date, currency_id, num_code, char_code,
    nominal, name, value_rate, vunit_rate
) VALUES
    ('2022-09-23', 'R01010', '036', 'AUD', 1, 'Австралийский доллар', 61.2345, 61.2345),
    ('2022-09-23', 'R01035', '826', 'GBP', 1, 'Фунт стерлингов', 108.7654, 108.7654),
    ('2022-09-23', 'R01090', '974', 'BYR', 1000, 'Белорусских рублей', 34.8901, 0.0348901),
    ('2022-09-23', 'R01235', '840', 'USD', 1, 'Доллар США', 87.6543, 87.6543),
    ('2022-09-23', 'R01239', '978', 'EUR', 1, 'Евро', 92.3456, 92.3456),
    ('2022-09-23', 'R01375', '156', 'CNY', 10, 'Китайский юань', 128.9012, 12.89012),
    ('2022-09-23', 'R01565', '392', 'JPY', 100, 'Японская иена', 63.4567, 0.634567),
    ('2022-09-23', 'R01810', '410', 'KRW', 1000, 'Вон Республики Корея', 64.5678, 0.0645678);


INSERT INTO exchange_rate (
    rate_date, currency_id, num_code, char_code,
    nominal, name, value_rate, vunit_rate
) VALUES
    ('2023-08-19', 'R01010', '036', 'AUD', 1, 'Австралийский доллар', 60.1234, 60.1234),
    ('2023-08-19', 'R01035', '826', 'GBP', 1, 'Фунт стерлингов', 116.7890, 116.7890),
    ('2023-08-19', 'R01090', '974', 'BYR', 1000, 'Белорусских рублей', 33.4567, 0.0334567),
    ('2023-08-19', 'R01235', '840', 'USD', 1, 'Доллар США', 94.5678, 94.5678),
    ('2023-08-19', 'R01239', '978', 'EUR', 1, 'Евро', 102.3456, 102.3456),
    ('2023-08-19', 'R01375', '156', 'CNY', 10, 'Китайский юань', 130.1234, 13.01234),
    ('2023-08-19', 'R01565', '392', 'JPY', 100, 'Японская иена', 64.5678, 0.645678),
    ('2023-08-19', 'R01810', '410', 'KRW', 1000, 'Вон Республики Корея', 69.8765, 0.0698765);